VERSION = '2026.09.01'

"""
2026.09.01
  - 배우 이름 필드 확장

2026.03.28
  - slug, clear logo 업데이트 설정을 분리
  - 매칭 시 검색 목록 일부 수정

2026.03.25
  - TMDB 메타를 사용할 경우 plex_mate에 slug, clear logo 업데이트 요청
  - API 요청 메소드를 POST로 변경

2026.03.21
  - 업데이트 용 토큰은 아래 순서에 따라 먼저 발견되는 토큰을 사용

    - Context (자동): 에이전트 요청에 담긴 로컬 토큰
    - 에이전트 설정 (수동): 사용자가 에이전트 설정에 입력한 토큰
    - Preferences.xml (자동): 설정 파일에 저장된 온라인 토큰 (리눅스 한정)
  
  - 특정 시즌만 선택해서 업데이트할 수 있는 설정 추가
    
    예시) {"12345": [202001, 202101], "67890": []}
      메타데이터 아이템 12345은 시즌 202001, 202101만 업데이트하고,
      메타데이터 아이템 67890은 시즌 업데이트(에피소드 포함)를 하지 않음
  
  - show.yaml을 보조 메타데이터로 사용하지 "않을" 섹션 목록 설정 추가
  - 메타데이터 새로고침시 번들 폴더 삭제 설정 추가
  - 시즌 경로에 Daum ID가 있을 경우 활용
    
    예시) 시즌 1001 미스터트롯의 맛 (2020) {daum-88030}

  - 시즌 번호 체계는 다음과 같이 처리

         0 ~    99: 일반적인 시즌
       100 ~   999: 재생 버전별 시즌
      1000 ~  9999: 사용자 정의 시즌
     10000 ~ 99999: 사용자 정의 시즌
    100000 ~      : 시즌 1로 취급

2026.03.15
  - 고아 파일 문제 수정
  - ktv 코드에 따라 메타데이터 적용 순서 변경
  - TMDB 폴더도 매칭 선택 가능하게 변경
  - 시즌 메타데이터 업데이트를 비동기로 실행
  - 각 시즌별 포스터를 중복 다운로드하는 문제 수정
  - 가능할 경우 WEBP를 JPEG 혹은 PNG로 변경

2026.03.03
  - webp 형식의 이미지 파일을 요청하지 않도록 헤더 수정(VP8X 포멧 이미지를 트랜스코딩 시 크래시 발생)
  - 기존 토큰 획득방식이 제한되어 Preferences.xml 파싱 혹은 직접 입력으로 변경

2025.07.30
  yaml 에이전트에서
  - poster, art가 https://cdn.discordapp.com/attachments/ 로 시작하는 경우, discord proxy사용을 위해 FF로 변경함.
  - poster, art, person photo 가 http로 시작하지 않는 경우 FF에 요청.
  
2024.10.10
  bug fix.

2024.10.09
  m3u8 재생시 http로 시작하지 않는 경우 ddns, apikey 사용.

2024.09.29
  ktv에서도 폴더명 코드 사용.

2024.09.23
  폴더명에 코드가 있는 경우 사용
  - 코드는 [] 아나 {} 안에 있어야 함.
  - 지원코드. 
    - FF에서 사용 코드. 모듈 char + site char + site ID
    - tmdb-XXXXXX, tvdb-XXXXXX

  예)  
  영화: tmdb - [MT957452] {tmdb-698687} / 왓챠 - [MXmOPpNlO]
  쇼:  tmdb - [FT116612] {tmdb-95557} / tvdb - [FU443951] {tvdb-434441}

2024.08.16 by ocelot     
  - 멀티디스크 앨범 정보를 yaml 파일에서 가져올 시 발생하는 에러 수정

2024.07.11
  - KTV 시즌번호 1900 제한 삭제
  
2024.06.18
  - SjvaShow 스캐너 수정   
    에피형식 and 시즌 번호 없음 and 하위폴더 숫자있는 경우 => 무조건 시즌 처리하는 방식에서 Force 형식일 때만 시즌 처리함.   
    단순 파일 분류를 위한 년도별로 파일을 나누었을 때 각 년도별 시즌처리 되는 것을 막음.   

2024.06.11
  - KTV 왓차피디아 추가처리

2024.06.02   
  - MAKEMATE1.E02.240522.1080p-SW.mp4  1회로 인식하는 SjvaShow.py문제 수정
  
2022.08.27
  - yaml music 트랙 정보 추가

2022.08.07
  - add service m3u8

2022.05.27
  - 트랙 rating에 멜론 좋아요 수 매칭.

2022.05.26
  - yaml show에서 시간값 ID가 겹치는 문제 수정

2022.05.14
  - ktv 단일 미디어, 멸티 시즌일때 항상 시즌1로 처리하는 문제 수정

2022.05.12
  - SjvaShow 스캐너 추가

2022.05.10
  - 뮤직관련
  
2022.02.06
  - 쇼 부가영상 update 순서 변경. 파일 부가영상이 온라인 부가영상 보다 먼저 나옴.

2021.12.29-2
 - JAVALL 관련 수정

2021.12.29
 - JAV Uncensored 검색 추가
 - JAV 전체 검색 추가. JAVALL|검색어

2021.12.28
 - JAV search_keyword 오른쪽 - 붙어지는 경우 대응

2021.12.12
 - KTV에서 FT로 tmdb 지정
   예) 닥터 슬럼프 리메이크 FT105262
   
2021.11.28
 - info.json 삭제 오류 수정
 
2021.11.05
 - KTV 시즌처리시 배우가 마지막 시즌만 나오는 문제 수정

2021.11.04
 - FTV에서 KTV검색어로 검색 기능. KTV|검색어
   시리즈 매칭을 위해서 필요

2021.11.03
 - ftv 스튜디오 []으로 나오는 문제 수정

2021.10.21
 -ftv 스튜디어 버그 수정
 
2021.10.21
 - yaml load 수정. (feat. 시우지우아빠)

2021.10.20
 - get_folderpath 수정

2021.10.18
 - "쇼에서 부가영상을 포함할 섹션 ID 목록" 옵션 추가
   F 애니메이션에서 메타새로고침시 부가영상 로딩하지 않기 위해..

2021.10.13
 - 컬렉션 관련 옵션 추가
 
2021.10.12
 - yaml show season 0
 
2021.10.05
 - ftv : 시즌 0도 검색되게
 - lyric URL 생성시에는 key만 넣고, 실제 정보는 메타에서 가져오도록

2021.10.04
 - yaml music 추가
 - yaml dummy agent 추가 : yaml 이외는 다른 처리를 하고 싶지 않을 때

2021.10.01
 - yaml code startswith 체크
 
2021.09.29
 - movie year bug fix
 
2021.09.26
 - JAV DVD로 통합 사용. (검색 실패시 AMA, FC2 순으로 시도)

2021.09.23
 - 기존 jav는 art같은 것이 없는 경우 []를 받았으나 f2c가 추가되면서 null로 리턴하고 있었음.
   필드마다 조건문 추가

2021.09.22
 - 쇼 yaml 파일 처리 추가
 - bug fix

2021.09.15 
 - yaml 라이브러리 포함
 - 영화 yaml 파일 처리 추가

2021.09.07
- jav  xxx-123cd1.json 생성되는 문제 수정

2021.09.02
 - ftv info.json 사용
 
"""
